# для решения большинства проблем с Юникодом в Python 2.7 импортируем фишку из будущего

from __future__ import unicode_literals

# запихиваем исходный массив текстов

reviews = ["""Телефон абонента: +7 916 000 00 01
Время: 10:34
Дата: 20.05.2017
Оценка: 1
Длительность разговора (мин.): 0:32
Комментарий: Общение с сотрудником вашей техподдержки мне не понравилось. Раньше всегда отвечала девушка с приятным голосом, а сегодня какой-то мужчина. Совсем никуда не годится, примите меры!!!""",
"""Телефон абонента: +7 916 000 00 02
Время: 9:20
Дата: 21.05.2017
Оценка: 5
Длительность разговора (мин.): 25:07
Комментарий: С моей проблемой мне помогли, большое спасибо!"""]

# создаём основной словарь и массив словарей; знаю, это неэкономно с т.зр. памяти, но возникли некоторые сложности
# пытался сделать через один промежуточный словарь через конструкции вида vsp_dict[field_name]=field_value / review_dict[tel_num]=vsp_dict
# но там получалось, что все значения основного словаря повторяли последний вспомогательный словарь

review_dict = dict()
dict_list = list()
i=0

for elem in reviews:
	if elem:
		for line in elem.split('\n'):
			dict_list.append(dict())
			if line:
				split_line = line.split(': ')
				field_name = split_line[0]
				field_value = split_line[1]
				dict_list[i][field_name]=field_value
				if field_name == 'Телефон абонента':
					tel_num = field_value
		review_dict[tel_num]=dict_list[i]
		i = i+1